# Задание3
season_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень",
               "осень", "осень"]
month_dict: dict = {1: "Январь", 2: "Февраль", 3: "Март", 4: "Апрель", 5: "Май", 6: "Июнь",
                    7: "Июль", 8: "Август", 9: "Сентябрь", 10: "Октябрь",
                    11: "Ноябрь", 12: "Декабрь"}
month = int(input('Введите номер месяца: '))
if 0 < month < 13:
    print(f"{month_dict.get(month)} - это {season_list[month - 1]}")
else:
    print('В году 12 месяцев')
